app/views/static_pages/home.html.erb

<div class="card-columns">
  <% Gossip.all.each do |gossip| %>
---
SELECT "gossips".* FROM "gossips"

          <small class="text-muted">
            <%= gossip.user.first_name %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]