app/controllers/static_pages_controller.rb

  def gossip
    @gossip = Gossip.find(params[:gossip_id])
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def author
    @author = User.find(params[:author_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]